import React from "react";
import "../productWhichPage/productMain.scss";
import { Link } from "react-router-dom";
import ListProduct from "../cardSection/ListProduct";
import axios from "axios";
const MacBook = ({ setBuy, SetBusket }) => {
  const [card, Setcard] = React.useState([]);
  React.useEffect(() => {
    const getMack = async () => {
      const { data } = await axios.get("http://localhost:3001/mackbook");
      Setcard(data);
      return data;
    };

    getMack();
  });
  return (
    <section className="default_for_buy">
      <div className="container">
        <div className="description_top_block">
          <p>
            <Link to="/">Головна</Link> <span className="trans">> MacBook</span>
          </p>
          <p className="buyDesc">
            Купити <span className="red">MacBook</span>
          </p>
        </div>

        <div className="iphone_flexCard">
          {card?.map((c) => (
            <ListProduct
              smalImg1={c.smalImg1}
              smalImg4={c.smalImg4}
              smalImg3={c.smalImg3}
              smalImg2={c.smalImg2}
              SetBusket={SetBusket}
              id={c.id}
              count={c.count}
              setBuy={setBuy}
              img={c.img}
              name={c.name}
              price={c.price}
            />
          ))}
        </div>
        <div className="botom">
          <h1>Купити Apple Mac </h1>
          <p>
            {" "}
            Продукція компанії Apple – синонім високої якості, престижності та
            відмінних технічних характеристик. Дитина Стіва Джобса і після свого
            натхненника намагається залишатися на острижі технологій, пропонуючи
            своїм шанувальникам найкращі пропозиції та встановлюючи орієнтир для
            інших конкурентів.
          </p>
          <h1>
            Apple Mac – надійний помічник для роботи, навчання та відпочинку
          </h1>
          <p>
            Окрім звичних смартфонів компанія активно розвиває і інші напрямки.
            В першу чергу, мова йде про ноутбуки та моноблоки iMac, які
            завоювали позитивну репутацію у користувачів завдяки своїй
            швидкості, зручності та практичності. Наприклад, ноутбуки MacBook не
            потребують особливого представлення і отримали заслужену
            популярність серед бізнесменів, студентів, програмістів, менеджерів
            середнього рівня та інших груп осіб. Причина у успішності власної
            операційної системи, відмінних технічних характеристиках, які можуть
            працювати з важкими додатками, великою кількістю вікон браузера або
            офісних програм. Дуже вражаюче і час автономної роботи завдяки ємній
            батареї. Одночасно ноутбуки Apple Mac максимально компактні і значно
            легші за аналоги інших виробників, що дозволить їх легко брати з
            собою у сумці в дорогу, командировку або подорож. Не менш популярні
            серед користувачів і настільні варіанти комп'ютерів iMac. Їх
            перевага у моноблочному виконанні, що економить час на робочому
            столі і поруч з ним, ніж грішать класичні версії персональних
            комп'ютерів. Одночасно подібна техніка цікава за технічними
            характеристиками, хоча у цьому напрямку Apple випускає новинки
            значно рідше, що обумовлено обсягом ринку. Разом з цим iMac чудово
            підходять найрізноманітнішим людям, починаючи від студентів і
            закінчуючи керівниками бізнесу. Також йому знайдеться місце в
            звичайній малогабаритній квартирі, що дозволить грати в звичні ігри
            і готувати робочі звіти, оформлювати курсову або дипломну роботу,
            дивитися відео.
          </p>
          <h1>Ціна Mac</h1>
          <p>
            Наш інтернет-магазин спеціалізується на продажу ноутбуків та
            моноблочних комп'ютерів виробництва компанії Apple. Вирішуючи
            зробити покупку нового пристрою саме у нас, ви отримуєте максимум
            переваг у вигляді розумної цінової політики, офіційної гарантії
            Apple та відсутності необхідності довго чекати свого замовлення.
            Отримати додаткову інформацію та зробити замовлення ви можете за
            телефоном або додавши товар у кошик і залишивши заявку прямо на
            сайті інтернет-магазину.
          </p>
        </div>
      </div>
    </section>
  );
};
export default MacBook;
